-- phpMyAdmin SQL Dump
-- version phpStudy 2014
-- http://www.phpmyadmin.net
--
-- 主机: localhost
-- 生成日期: 2018 �?12 �?02 �?18:48
-- 服务器版本: 5.5.53
-- PHP 版本: 5.6.27

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `bobo`
--
CREATE DATABASE `bobo` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `bobo`;

-- --------------------------------------------------------

--
-- 表的结构 `blog`
--

CREATE TABLE IF NOT EXISTS `blog` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `pid` int(10) unsigned NOT NULL,
  `author` int(10) unsigned NOT NULL,
  `belong` varchar(20) NOT NULL,
  `title` varchar(100) NOT NULL,
  `description` varchar(200) NOT NULL,
  `content` text NOT NULL,
  `tags` text NOT NULL,
  `read` int(10) unsigned NOT NULL,
  `agree` text NOT NULL,
  `disagree` text NOT NULL,
  `isDel` tinyint(1) NOT NULL,
  `time` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

--
-- 转存表中的数据 `blog`
--

INSERT INTO `blog` (`id`, `pid`, `author`, `belong`, `title`, `description`, `content`, `tags`, `read`, `agree`, `disagree`, `isDel`, `time`) VALUES
(1, 0, 1, 'aw', '聊聊swift语言中的“??”', '大家好，我是liuyubobobo :-)  我在慕课网上发布了一系列的swift教学视频，称为《玩儿转Swift》系列。这个系列系统地从头到尾讲解了swift的语法知识，夹杂了一部分代码书写规范、设计模式和语言范式方面的内容。但是，无论是计算机语言的学习，还是ios开发的学习，都是一个太大的话题。特别是swift语言这个新兴的语言，还是有很多细节，是我的系列课程无法顾及到的', '大家好，我是liuyubobobo :-)\n\n我在慕课网上发布了一系列的swift教学视频，称为《玩儿转Swift》系列。这个系列系统地从头到尾讲解了swift的语法知识，夹杂了一部分代码书写规范、设计模式和语言范式方面的内容。但是，无论是计算机语言的学习，还是ios开发的学习，都是一个太大的话题。特别是swift语言这个新兴的语言，还是有很多细节，是我的系列课程无法顾及到的。为此，我尝试将一些有价值的内容以文字的形式呈现出来，希望大家有所收获：）\n\n这次，我试试更加深入地，和大家聊聊swift中的?? ：）\n\n最近很多同学问我，swift语言中，??是怎么回事。因为在微信交流中，问题不能被清晰表述，所以我很奇怪对于这么简单的一个运算符，会有这么多同学有疑问。后来随着对问题理解的深入，我渐渐意识到了大家遇到的??的问题和我想象的是不一样的。正巧，对于??，就算只是简单地把它当做运算符看待，也有很多值得挖掘的地方，为此，便有了这篇文章，绝对深入地来探讨一下：\n\n为什么要有?? -- 空合运算符\nswift实现空合运算符的背后\n??仅仅是一个运算符吗？\n众所周知，可选型（Optional）是swift语言的一个很重要的语言特性。窃以为，从swift1到现在的swift2.2，很多改变都直接或者间接地和可选型相关。其中，在swift2中“偷偷”引入了一个看起来很稀疏平常的新运算符—— ??，英文名称为Nil Coalescing Operator。\n\n在最新的swift文档的官方中文翻译中，??被翻译成了空合运算符。如果我没有记错，在第一版的官方翻译中，将其翻译成nil聚合运算符。其实，“聚合”二字属于直译，正是coalesce（读作/kəʊəˈlɛs/）一词的意义，现在的翻译“空合”，将nil的含义——“空”，也放在了其中。值得一提的是，空合运算并非swift语言的首创，C#，Perl，PHP7.0.0等等均有这个运算符（或者叫Null Coalescing Operator）\n\n空合运算符做的事情很简单。x ?? y表示判断x是否为nil，若不为nil，则将x解包后返回，否则，取y的值。比如下面的代码：\n\nlet username = loginName ?? "Guest"\n假设有一个“系统”，用户可以实名登录，也可作为游客匿名登录，此时，用户的登录名loginName则应该表示为可选型。而系统最终显示的用户名username则需要根据loginName的内容做一个判断，如果loginName为空，则使用默认名称"Guest"。\n\n好了，大多数教程讲到这里就已经讲完了空合运算符。但是对于我们这群超酷的swifter而言，这一切仅仅是开始：）\n\n1. 为什么要有空合运算符？\n首先，一个显而易见的问题是，这样写和下面两种写法，除了代码更简洁以外，还有其他区别吗？\n\n\n// 写法1，使用if-else\nlet username: String\nif let loginName = loginName{\n    username = loginName\n}\nelse{\n    username = "Guest"\n}\n\n// 写法2，使用三目运算符(ternary operator)\nlet username = loginName != nil ? loginName! : "Guest" \n恩，在我们的这个例子中，答案是没有区别。??在这里的使用就只是让代码更加简洁了。但要知道，如果我们只是因为代码的简洁就给语言添加各种奇怪的符号，这种语言势必可读性很差。那么多语言都引入空合运算符，绝不仅仅只是因为代码简化，难道空合运算还有功能作用？\n\n相信很多朋友早就感觉到了，空合运算x ?? y像极了一种三目运算符使用的简化形式。三目运算符的使用是这样的：condition ? x : y。我们需要判断表达式condition的真假，若为真，则取x，否则取y。而空合运算就是在判断可选型是否为nil的情况下，一种特殊的使用三目运算的形式：x != nil ? x : y。因为在很多语言中，空可以和布尔值False直接对应，所以我们抽象地将其称为x ? x : y\n\n为什么这种特殊的使用三目运算符的方式要被一个新的符号??所取代？答案就蕴藏在x ? x : y这个式子中。这里注意，x被使用了两次！当我们的x仅仅是一个变量的时候，这无关痛痒。但如果x是一套复杂的逻辑呢？\n\n依然以我们引以为傲，宣称自由民主的可以匿名登录的系统为例。现在登录过程有一个函数login()，返回String?，登陆成功则返回登录用户名的String，失败则返回nil。那么此时，使用三目运算符获取系统显示的用户名就变成了这个样子：\n\nlet username = login() != nil ? login()! : "Guest" \n有没有觉得整个人都不好了？为什么要登录（调用login()）两次？在这里如果只是对效率有影响也就罢了（也！！就！！罢！！了！！你的年终奖应该泡汤了！）更关键的是，如果login()函数带有副效果（side effect）怎么办？比如，用户登录成功的话，顺便给一个记录用户登陆次数的指示器+1，此时，逻辑都出问题了，用户的每次登录被记录了两次！\n\n空合运算符因此应运而生。相较于x ? x : y，在x ?? y中，保证了x只被运算了一次。这便是空合运算符的功能作用。\n\nlet username = login() ?? "Guest" \n当然了，很多同学都表示不会写出login() != nil ? login()! : "Guest"这么傻的代码。但是，要知道，在这里我只是举一个例子。对于login这么重要的模块儿，我们当然不会这么做。但是，你真的敢保证，自己在庞大的工程深处，没有写出过类似性质的代码吗？哦，你敢保证？我的意思是，你敢保证你的队友，不是，对手公司派来的内奸，也不会写出这样的代码吗？：）\n\n2. 空合运算符的背后\n你以为空合运算背后真的这么简单吗？现在让我们在XCode中，按住Command点击这对儿可爱的??，看看这个运算符在swift标准库中是怎么声明的？答案是这样的：\n\npublic func ??<T>(optional: T?, @autoclosure defaultValue: () throws -> T) rethrows -> T\n??左边的那个变量叫optional，是一个T?类型，右边那个变量叫defaultValue，意思是默认值。恩，很好，非常可以理解，optional是可选型，万一是nil我们就用默认值（defaultValue）。这和我们的理解完全一样，so far so good。但是，等等，defaultValue的类型是什么鬼？() throws -> T，这俨然是个函数啊？可我们在使用的时候一直在传入一个变量值甚至是硬编码的常量值啊？在defalutValue 前的那个@autoclosure又是什么鬼？\n\n\n\n事实上，之前，我们一直在探讨x ?? y这个模型里的x，但是y呢？\n\n回到我们自由民主的伟大系统中，为了昭显这个系统的伟大，对于游客，我们的系统才不会使用千篇一律的"Guest"这个名字呢，而是使用世界一流的智能算法，为每一名游客起一个好听到没朋友的名字。恩恩，这个功能被封装在了一个看起来很平庸的函数中——generateGuestName()。我们就是要这么低调。虽然这个函数里面并不低调，它使用了最先进的智能算法，实时采集了全世界最酷的名字（包括狗的名字，当然，这属于机密，不能外泄），然后随机选择了一个...恩，总之很复杂，消耗计算资源很多就对了。\n\n现在，我们的系统为了显示用户名，就要这样：\n\nlet username = login() ?? generateGuestName() \n这么写有什么问题？如果不经过特殊处理，编译器会先执行login()，之后不管login()返回值是不是nil，都再调用一下generateGuestName()！不信，我们自己试验一下。照着??的声明，实现一个我们自己的空合运算符，管它叫???吧：\n\n\ninfix operator ???{}\nfunc ???<T>(optional: T? , defaultValue: T) -> T{   \n    if let value = optional{ return value }\n    return defaultValue\n}\n之后，我们这样尝试使用一下我们自己的 ???:\n\n\nfunc A() -> String{\n    print("A is called!!!")\n    return "A"\n}\n\nfunc B() -> String{\n    print("B is called!!!")\n    return "B"\n}\n\nlet AorB = A() ??? B()\n\n// 控制台打印出\n// A is called!!!\n// B is called!!!\n看看控制台！Oh My Gosh，B is called被打印了出来！尽管A()函数没有任何质疑的为我们返回了一个非可选型的字符串，B()函数依然被执行了！\n\n回到我们的登录系统，如果我们不做些什么，login() ?? generateGuestName() 这个式子将无视你是否有真实的名字，都要强行调用一下generateGuestName()。我们的系统看起来不是那么自由民主了。（当然，其实我只是从效率角度思考问题。毕竟这关系到我的年终奖）\n\n怎么解决这个问题？答案是让defaultValue不是一个值，而是一个函数，这样一来，我们可以在需要的时候再执行这个函数，而不需要的话，就不执行。我们把自己的???这样改写：\n\n\n// 注意defaultValue的定义，传入的是一个函数参数！\nfunc ???<T>(optional: T? , defaultValue: ()->T) -> T{\n    \n    if let value = optional{ return value }\n    return defaultValue() \n    //注意defaultValue后面的小括号，这是一次函数执行。\n    //在此之前，defaultValue不会被计算！\n}\n\n// A(), B()两个函数定义和前面一样，不再重复\n\nlet AorB = A() ??? B  \n// 注意，此时，???的第二个参数是传入一个函数\n\n// 控制台打印出\n// A is called!!!\n// 并且只有A is called!!! 欧耶！\n非常棒！这样我们解决了一个很重要的世界难题。我没有夸张，听说过最短路原则吗？我们为自己的???符号添加上了执行最短路原则的能力！像伟大的&&运算符和````运算符一样，只有在需要的时候，我们才会计算第二个操作符的值！\n\n不过，这样一来，缺点也很明显。一方面，A() ??? B这个调用形式很奇怪（竟然不对称？这是要逼死处女座啊！？），另一方面，我们的???的第二个参数只能传入函数型参数，为了传入一个值，我们必须手动将其封装成一个函数，当然，最简单的封装方式是做成一个闭包，像这样：\n\nlet AorX = A() ??? {return "X"}\n这未免太不方便了:(\n\n为此，苹果向我们提供了一个新的关键字，@autoclosure，看名字就知道了，这个关键字将一个类型自动转换成了一个闭包。如果你本身就是闭包（或者函数），非常好，你将享受这种延迟调用带来的优势；但如果你不是闭包，你将被自动封装成闭包，同时也享受了这种延迟调用带来的性能提升！比如"X"，就会被封装成{return "X"}\n\n试试看：\n\n\ninfix operator ???{}\nfunc ???<T>(optional: T? , @autoclosure defaultValue: ()->T) -> T{\n    if let value = optional{ return value}\n    return defaultValue()\n}\n\nlet AorB = A() ??? B()\nlet AorX = A() ??? "X"\n以上两个调用都是合法的，并且在第一个调用中，只有A()被执行了，B()不会被执行。使用@autoclosure，你将之前的两个问题都解决了。又可以愉快地和处女座的同学做朋友了：）\n\n值得一提的是，此时，你已经可以扔掉自己定义的???而更加自信地去使用系统提供给你的??了。我们的???和系统的??逻辑上是一模一样的，只不过系统的??还提供了错误处理的功能（throws and rethrows）。以后有机会，我再向大家介绍throws和rethrows里好玩儿的东东，包括@autoclosure相关，还有很多值得我们探讨的内容。恩，最后的这句话是广告，不过你已经看完了：）\n\n3. ?? 仅仅是一个运算符吗？\n到目前为止，我们一直在分析空合运算符。但要注意，我的文章标题不是“聊聊空合运算符”，而是“聊聊??”。在swift语言中，??还能另作他用？\n\n随便创建一个ios的项目，然后随便找一个可以执行的地方写这么一行代码:UIApplication.sharedApplication().delegate?.window，看看这个window的类型，你发现了什么？\n\n\n\n怎么类型是UIWindow??，两个问号是怎么个意思？空合？空在哪里？怎么合啊！？还能不能愉快地玩耍了？老子不干了！\n\n\n\n别急，我们冷静下来，分析分析。在这里，??显然是修饰UIWindow的（咦？怎么像英语语法课？恩，语法课都差不多啦，这里是swift语法课...）就像?用于修饰UIWindow，就构成了UIWindow的可选型UIWindow?一样。为了方便，我们下面举例用大家都喜闻乐见的Int，我们可以这么声明一个类型：\n\nvar x: Int??\n编译器静悄悄地让这句声明通过了编译，连一丁点儿抵抗的意思都没有。这个神秘的x是什么类型？\n\n不要想得太复杂，这里没有任何神秘的元素，既然?表示可选型，这个??表示的就是可选型的可选型。换句话说，我们的变量x中，可以存放nil，也可以存放一个整型的可选型Int?\n\n这么理解是不是清晰了很多？也就是说，如果x里要真的存放了一个整数的话，我们需要解包两次！比如这样：\n\n\nvar x: Int?? = 42\nif let anotherX = x{\n    // 此时，anotherX的类型是整型的可选型Int?\n    // 要想使用其中的值，还是需要解包！\n    if let value = anotherX{\n        print(value)\n    }\n}\n// 控制台打印出42\n当然了，我们也可以这么解包。这里，希望你没有被太多的x搞晕：\n\n\nif let x = x, value = x{\n    print(value)\n}\n// 控制台打印出42\n不过看起来这么欠揍的x，很多同学可能更愿意硬来...\n\n\nprint(x!!)  // 注意，是两个叹号！！\n// 控制台打印出42\n恩，理解了这个可选型的可选型??以后，相信脑洞大开的各位swifter一定会满心欢喜地写出这样的声明:\n\nlet realX: Int???????????????? = 42\n编译器是不会报错的，一切都合法。下次迷惑对手的时候就这么干。\n\n\n\n不过言归正传，??除了迷惑对手以外，有什么实际意义？毕竟我们作为闷声发大财...哦，不对，闷声研究计算机科学的swifter来说，没有那么多对手啊...\n\n实际上，对于我们之前的例子而言，UIApplication.sharedApplication().delegate下的window类型是UIWindow??，这背后是两个机制共同作用的结果。我们首先需要看一下这个UIApplication.sharedApplication().delegate是什么东东？按住Command点击delegate，我们可以看到，这个delegate是定义在UIApplication下的一个UIApplicationDelegate?类型的成员变量：\n\n\npublic class UIApplication : UIResponder {\n    public class func sharedApplication() -> UIApplication\n    unowned(unsafe) public var delegate: UIApplicationDelegate?\n    // ...\n    // 以下省略很多代码\n}\n按住Command看一下UIApplicationDelegate的定义，就会发现，UIApplicationDelegate是一个协议，里面的window这个变量是这么定义的：\n\n\npublic protocol UIApplicationDelegate : NSObjectProtocol {\n    // ... 省略了很多代码 \n\n    @available(iOS 5.0, *)\n    optional public var window: UIWindow? { get set }\n    // XCode7.3中，在UIApplication.h的395行\n\n    // ... 省略了很多代码\n}\nUIApplicationDelegate是一个协议。在swift中，协议中定义的属性或者方法如果想被表示为可选择被实现的，需要加上optional的关键字（还要声明成@objc，有时间再深入介绍啦）。相应的，在协议的实现中，这个“可选择被实现的属性或者方法”，就会被解析成可选型。这是第一个?。\n\n另一个层面，在这个协议的定义里，window变量本身就被定义成一个可选型UIWindow?，于是有了第二个?。\n\n也就是说，第一个?表示这个变量在协议中是可选择实现的；第二个?，表示这个变量可以为nil。这便是我们的例子里，最终实现出来供我们使用的UIApplication.sharedApplication().delegate?.window，其类型是UIWindow??的原因。\n\n但在我们实际编程中，会经常使用诸如Int??这种类型吗？反正我还没有遇到过。如果大家发现了需要Int??才能合理表意的场景，请一定和我分享：）\n\n我在慕课网给大家分享的课程：玩儿转Swift 2.0\n\n版权声明：liuyubobobo原创作品。仅允许对原始文章链接进行转发传播。如需转载，请联系原文作者：liuyubobobo@gmail.com。未经允许转载，必追究法律责任。\n\n转载请注明出处，谢谢合作', 'swift ??', 9, '', '', 0, 1543774759),
(2, 0, 1, 'aw', '新的一年，写一系列算法分享，名曰【算法杂谈】，此为序', '去年10月底，我在慕课网发布了一个新课程——算法与数据结构。其实思考做这样一个课程已经很久了。因为自己在本科的时候曾经参加过ACM，成绩还算可以；后来研究生毕业以后参与创业，经常和各式各样的创业团队和技术人打交道；由于自己的技术背景，也经常受邀参与一些创业团队的技术面试，让我“把把关”；更重要的是，我还一直保持着关注算法的热情。闲暇时间随便思考一些算法问题是我的一个小爱好，就好像有人喜欢玩儿填字游', '大家2017新年好：）\n\n去年10月底，我在慕课网发布了一个新课程——算法与数据结构。其实思考做这样一个课程已经很久了。因为自己在本科的时候曾经参加过ACM，成绩还算可以；后来研究生毕业以后参与创业，经常和各式各样的创业团队和技术人打交道；由于自己的技术背景，也经常受邀参与一些创业团队的技术面试，让我“把把关”；更重要的是，我还一直保持着关注算法的热情。闲暇时间随便思考一些算法问题是我的一个小爱好，就好像有人喜欢玩儿填字游戏，有人喜欢做数独一样。从经典的算法思想的应用；到精灵古怪甚至有些不靠谱的“算法脑筋急转弯”；再到热得大红大紫的机器学习算法，我都来者不拒。因为和自己正在做的事情相关，很多算法思想也能在实际项目中有所实践。去年，一家在北京做智能创业的团队还邀请我和他们的技术同学们分享了关于机器学习算法的一些思考。\n\n因为一直关注着算法，也了解国内学府中算法教学的一些弊端，所以一直想做一套算法课程，和大家分享一下自己的思路。可是想归想，真的做起来确实还是很费劲的。算法是一个太大的领域，里面的知识点众多又很琐碎，加上课程时间有限，大家的水平又不尽相同，平衡这一切对我来说是一个很大的挑战。当我用尽自己的洪荒之力把整个课程做出来以后，其实也并没有能让自己100%的满意。所幸，我还是坚持了一些自己希望的东西，比如整个课程尽最大程度地强调实践，而暂时摒弃了很多枯燥的算法分析。我认为对于计算机学习来说，应该把实践放在理论分析的前面（放在前面不代表抛弃！）。甚至很多内容，可能需要先做出来，才能想通。即便算法这个看似很理论的领域也应如此。于是就有了课程中，我们不断尝试将算法运行在大数据上，来体会算法设计的作用和算法优化的威力。类似下面这样的算法性能测试，近乎是贯穿进课程的每一章节的。\n\n\n\n稍微改变一下思路，改动几行代码，整个算法的效率就发生了改变。这是我希望同学们能体会到的。通过亲自操作，了解算法课本上抽象地复杂度分析具体体现在了什么地方。很多同学在这个过程中体会到了“玩儿”算法的乐趣，其实这也是我希望传递给大家的。我也是因为算法如此“好玩儿”，才会闲来无事研究算法问题的：）\n\n\n\n让我高兴同时也是意想不到的是，很多同学通过这个课程收获了更多。在群里，有现在战斗在ACM一线的算法大牛，他们愿意学习这门课程，给了我很大的信心：\n\n\n\n也有职场老鸟。在晋升的道路上，这门课程能够有所帮助，也是我的荣幸：）\n\n\n\n还有的同学拿到了offer，虽然我还在策划专门针对算法面试的课程：）\n\n\n\n按照慕课网的规矩，每一个新课，尤其是实战课，讲师最好写点儿什么，来对新课做一个宣传。我本来酝酿了很久，想写一篇类似《算法为什么重要》这样的文章。不过后来发现，其实很多想说的话，都放在了这个课程的第一小节，《当我们谈论算法的时候，我们在谈论什么？》里面（虽然由于版权的原因，慕课网删掉了我举得很多算法在影视作品包括音乐、游戏等娱乐领域实际应用的例子。有时间，我会再整理一下的）。正因如此，这篇宣传文章，我迟迟没有写，而是把更多的精力，放在了做这个课程的“客服”上，直到今天。\n\n但是回头看，我发现大多数同学，还是很能理解算法的意义的。尤其是现在这个时代，智能领域开始大规模地爆发，算法一词也被越来越多的人所熟知。（虽然机器学习领域的算法和我们在这里谈论的“经典”算法还是有着本质的区别。）不过尽管如此，对于学习算法的必要性，依然有很多争论。在这里，我并不想站队，也不想非常极端地说算法是必须要学的，或者是完全不重要的。生活经验告诉我们，非黑即白地看待任何问题，所得出的结论大抵都是片面的。我们所生活的世界是如此的复杂，以至于把这个世界尽量看完整就已经是一件极度艰巨的任务了。或许我们不应该着急下结论，而应该更多地去了解事情的每一个侧面，通过这些了解，以及自己的思考，结合自己的经历和优势，选择一条最适合自己的道路。深入展开谈“学习算法到底是不是必要的”这个话题，可能需要再写一篇文章了。有时间我会再和大家深入分享一下我对这个问题的看法：）但我相信一个简单的共识应该是有的：了解算法基础，并不是什么坏事儿。更何况稍微有点儿水平的IT公司，都一定要面试算法，尽管其工作岗位可能在一些同学眼中“并不需要算法”。而且，算法面试的内容，也并没有那么深奥，远远不需要啃完一本厚厚的《算法导论》。其实，这个课程是一个很好的开始。\n\n很多同学很纠结，因为这个课程是使用C++语言写的，但是大多数同学的工作语言不是C++。虽然大多数同学都接触过C/C++，但也对C/C++有畏惧感。对此我完全理解。毕竟，这个年代还需要手动管理内存的语言已经不多了。其实这也是我在做这个课程的过程中，很纠结的一件事情。最后，我还是选择了C++语言。1）我认为C++的覆盖面最广，即使很多同学“不精通”，但学习算法也不需要精通C++。算法是一种思想，语言是表达的工具，我希望大家专注在算法思想的表达上；2）顺便简单看看内存的管理，包括指针的操作，也没什么不好，毕竟计算机底层是相通的；3）通过课程学习，看懂了算法思想，大家再尝试用自己熟悉的或者常用的工作语言，把这些算法再实现一遍，其实是非常好的训练，也对更深入的理解另一门语言有帮助。\n\n尽管如此，依然有同学对待学习非常“完美主义”，看了一部分课程以后，表示自己又回去啃C++了。我很欣赏这样的学习态度，但对于这门课程来说，我认为大可不必。我在这个课程的群里和问答区里都已经分享了我的一点学习经验：学习切忌完美主义。获得了很多同学的认同。\n\n\n\n尽管如此，我和慕课网的小伙伴们也意识到了：应该为大家提供另一个选择。为此，这门课成后续会再做一个java实现版本，实现课程中的所有代码并配有视频。java版本不会单独收费，放在已有课程中。想看C++实现的同学请点击C++的视频；想看java实现的同学请点击java视频。这个事情可能要等到2017年上半年才会完成。在这里，我先对等待的同学说抱歉了。\n\n对于这个课程，我还一直在思考，对于已经购买这个课程的同学，如何能够让他们更加的物超所值？在这个课程的介绍里，我曾经说过，希望这个课程是“活”的。毕竟，算法领域零零散散的问题，有太多内容可以分享。就算不是零散的内容，每一个算法可以延展出的内容也太多了。我在短短的一个课程里，很难把他们都涵盖上。正因为如此，我希望这个课程的内容只是一个“主线”。基于这个主线，希望大家能够对基础的算法和数据结构有一个整体的认识，进而，可以自己再不断深入，在繁杂的算法世界里遨游。非常高兴，有些同学通过这个课程的学习，拥有了这样的收获。\n\n\n\n不过也正因为算法领域有很多零散的问题，我决定从2016年12月26日开始，也就是这个课程正式上线八周以后（这个课程最初设计希望同学们花八周时间学完），每周分享一到两个算法的话题。这些话题有可能是结合课程相关的算法面试问题；有可能是课程没有细讲的某个具体算法思想或者数据结构；也可能是我觉得值得分享的学习经验。和代码相关的分享，我都会在一周后给出完整的代码和解答思路；如果是面试问题，我会尽量选择在线OJ支持的问题，这样方便同学实际操作，来检验自己的实践水平。对于这些分享，我会有选择地放一部分在慕课网的手记中，公开和大家一起分享。大家也可以把我的这个分享内容理解成是防盗版的一个手段。毕竟盗版可以一次性盗走视频内容，但是每周盗走不固定的分享内容，成本就高了很多。希望通过这个举措，大家觉得购买bobo老师的这个课程不太吃亏：）\n\n新的一年，每个人都有自己的小目标。我的小目标，就是能够把这个有意义的分享坚持下去。让更多的同学面对算法不要总是挠头。我也不知道自己能不能做到，但是不去尝试，就永远做不到。也希望大家能够监督我。随时给我提建议。\n\n自己没什么文采，于是给这个算法分享起了一个很俗的名字——《算法杂谈》。此为序。\n\n祝大家在2017年，都收获满满。在追寻梦想的道路上，更加斑斓：）\n\n关于我的更多文章，欢迎关注我的个人公众号：是不是很酷：）\n\n\n\n点击查看更多内容\nC++数据结构职场生活\n本文原创发布于慕课网 ，转载请注明出处，谢谢合作\n\n149人点赞', '新年 算法', 2, '', '', 0, 1543774991),
(3, 0, 1, 'aw', '【算法杂谈 1】 从一道面试题再看三路快排partition', '在这次分享中，我将为大家回顾一下排序算法，同时，详细解析一下LeetCode中第75个问题：Sort Color。这个问题是Facebook，Microsoft和Pocket Gems的面试题。在LeetCode中难度标记为Medium：）', '在我的课程算法与数据结构中，我向大家详细介绍了快速排序这个最经典的排序算法。在这里为大家简单复习一下，没有学习这门课程的同学，也可以简单看到一个轮廓。\n\n![http://upload-images.jianshu.io/upload_images/28845-0c2eba5cdd50e211.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240](http://upload-images.jianshu.io/upload_images/28845-0c2eba5cdd50e211.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)\n\n快速排序算法的思路是每次选择一个元素作为标的点（pivot），将整个数组的所有元素分为小于这个元素和大于这个元素两部分，之后再递归地对左右两部分分别进行这个过程，直至整个数组有序。\n\n\n\n显然，在这个过程中，“选择一个元素作为标的点（pivot），将整个数组的所有元素分为小于这个元素和大于这个元素两部分”这步操作是最重要的，也是快速排序的核心所在。这个步骤被称为 Partition。\n\n如果使用一个辅助空间来实现Partition是一件非常简单的事情。但是如果不使用辅助空间，原地（in place）地进行partition，可能就稍微有些难度了。虽然有难度，但绝非高不可攀。有兴趣的同学，不妨把这个问题看作是一个面试题，自己实现一下看看：）（这是一个基础的需要大家能够进行白板编程的问题，请大家一定打好基础）\n\n我们在课程中首先介绍了Partition的一个经典实现，代码简单优雅的令人发指：\n\n（以下代码均使用C++代码，请其他语言的同学看懂逻辑以后尝试转换成自己熟悉的语言：））\n\n// v为pivot，初始存储在arr[l]的位置\nint j = l; // 循环过程保持 arr[l+1...j] < v ; arr[j+1...i) > v\nfor( int i = l + 1 ; i <= r ; i ++ )\n    if( arr[i] < v )\n        swap( arr[++j] , arr[i] );\n\nswap( arr[l] , arr[j]);\n// 此时，j指向pivot的正确位置\n关于这个算法的动画演示，课程中有详细介绍，不再赘述。有兴趣的同学或者印象不深的同学，强烈建议用自己的小的测试用例（6-10个数据即可），用纸笔自己走一遍这个程序，加深理解：）\n\n但我们很快就发现，这样的一个快排，在面临有序或者近乎有序的数组时，会退化成为一个O(n^2)的算法。于是我们使用了一个很简单的随机选取pivot的方式来处理这个问题。这步随机化让快速排序的时间期望成为了O(nlogn)，并且只有极低的概率退化为O(n^2)。关于这一点，背后的数学证明比较复杂，对背后的数学不感兴趣的同学，只要相信这个结论就好了。事实上，n不需要太大，在100这个量级，其退化成O(n^2)算法的概率就已经低于大家彩票中大奖的概率了：）\n\n但是，我们又会发现，这样的一个快排，面对有大量重复元素的数据时，还是有可能退化成O(n^2)级别的。于是我们介绍了双路快排的Partition思路。通过这个思路，我们可以进一步优化，提出三路快排的思想。三路快排要做的事情，其实就是将数组分成三部分：小于v，等于v和大于v，之后递归的对小于v和大于v部分进行排序就好了。\n\n![http://upload-images.jianshu.io/upload_images/28845-226a8b7199b406f4.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240](http://upload-images.jianshu.io/upload_images/28845-226a8b7199b406f4.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240)\n\n三路快排的Partition代码是这样的。依然是，这个算法的动画演示，课程中有详细介绍，不再赘述。有兴趣的同学或者印象不深的同学，强烈建议用自己的小的测试用例（6-10个数据即可），用纸笔自己走一遍这个程序，加深理解：）\n\n// v为pivot，初始存储在arr[l]的位置\nint lt = l;        // 循环过程中保持 arr[l+1...lt] < v\nint gt = r + 1;    // 循环过程中保持 arr[gt...r] > v\nint i = l+1;       // 循环过程中保持 arr[lt+1...i) == v\n\nwhile( i < gt ){\n    if( arr[i] < v ){\n        swap( arr[i++], arr[lt+1]); lt ++;\n    }\n    else if( arr[i] > v ){\n        swap( arr[i], arr[gt-1]); gt --;\n    }\n    else // arr[i] == v\n        i ++;\n}\n\nswap( arr[l] , arr[lt] );\n// 此时 arr[lt...gt-1]部分为数组中元素等于v的部分\n// 之后只需要递归地对arr[l...lt-1]和arr[gt...r]两部分进行三路快排即可\n三路快排如此好的解决了近乎有序的数组和有大量重复数组的元素排序问题，以至于在很多语言的标准库中，排序接口使用的就是三路快排的思路，比如Java语言：）\n\n好了，我们非常快速地回顾了一遍快速排序算法。下面，我们来看已到面试题：LeetCode上编号为75的题目：Sort Color。请英文好，或者想练习英文的同学，直接点链接读题。只想阅读中文的同学，可以直接看下面的分析。\n\n这个问题，LeetCode告诉我们，是Facebook，Microsoft和Pocket Gems的面试题。在LeetCode中难度标记为Medium。怎么样，是不是觉得很高大上？\n\n题目大意是：有一个数组，其中的元素取值只有可能是0，1，2。为这样一个数组排序。\n\n当然了，面对这个问题，大多数同学已经会想，肯定不是用普通的排序算法完成这个任务吧？嗯，既然题目有特殊的条件，肯定有其他的思路，但是如果在真正的面试或者笔试或者机试中，如果你一时没有更好的解法，用最笨的方法也比没有方法强。这就好像在实际项目中，我们不一定一上来就采用最优的解法解决问题，我们首先要解决问题，再谈优化。所以，这样解决问题，我觉得不寒碜：）\n\n/// 解法一：直接使用排序接口，时间复杂度O(nlogn)\nclass Solution {\npublic:\n    void sortColors(vector<int>& nums) {\n        sort( nums.begin(), nums.end() );\n        return;\n    }\n};\n不过就像我们前面介绍的一样，这样的解法未免没有充分利用我们的数据的特殊性。要知道，我们的数据取值只有三种可能啊！那么，我们其实可以非常方便的使用一次扫面，计算出0，1，2三个元素的个数，然后直接把他们再按照0，1，2的顺序和个数，放回原数组不就好了！这样，我们只需要两次遍历：第一次统计元素个数，第二次放回原数组，就解决了问题！\n\n/// 解法二：基于计数排序的解法，时间复杂度O(n)，需要两遍遍历\nclass Solution {\npublic:\n    void sortColors(vector<int>& nums) {\n\n        int count[3] = {0};  // count[i]表示元素i的个数\n        for( int i = 0 ; i < nums.size() ; i ++ ){\n            assert( nums[i] >= 0 && nums[i] <= 2 );\n            count[ nums[i] ] += 1;\n        }\n\n        int index = 0;\n        for( int i = 0 ; i < count[0] ; i ++ ) // 安置count[0]个0\n            nums[index++] = 0;\n        for( int i = 0 ; i < count[1] ; i ++ ) // 安置count[1]个1\n            nums[index++] = 1;\n        for( int i = 0 ; i < count[2] ; i ++ ) // 安置count[2]个2\n            nums[index++] = 2;\n\n        return;\n    }\n};\n上面的代码很好理解，在这里提示大家两个小问题。\n\n大家可以看到，在第一遍遍历的时候，我添加了一个assert语句，来确保传入的nums中的每个元素，取值确实都是0，1，2的。这让我们的代码更严谨。当然了，对于错误处理，我们也可以抛异常或者走别的逻辑，在这里，我简单的使用assert。在面试过程中，表明我care这个问题了，点到即可。\n大家可以看到，后面我是用了三次循环，分别按照0, 1, 2三个元素。这在这个问题中是有效的，但是如果我们的nums的取值范围是0-100呢？0-1000呢？事实上，同样的思路依然有效。但是，我们在第二次遍历安置元素的时候，就不能使用这样的写法了。那要怎么写？在这里给大家留一个小练习：）\n事实上，这个算法的思路，就是计数排序（Counting Sort）算法的思路。计数排序可以使用O(n)的时间，来解决元素取值范围固定且相对较小的一组数据的排序问题。怎么样？是不是非常有意思？如果我们为我们的待排序数组加上一些条件限制，就能突破O(nlogn)这个界限。\n\n实际上，我们经常说的排序算法复杂度至少为O(nlogn)，是有一个前提的，即我们的排序算法是基于元素间的比较的。换句话，严谨地说：基于比较的排序算法，其时间复杂度至少为O(nlogn)的。仔细看看我们上面的计数排序的思路，元素之间根本没有进行比较，我们不需要在任何时候看诸如nums[i]和nums[j]之间的大小关系。\n\n非基于比较的排序算法还有一些，有兴趣以后再向大家介绍。在这里，希望大家通过这个问题，能够自学计数排序算法，完成一个更加灵活的计数排序算法的接口：）\n\n算法有意思的地方就在于，我们总能问自己，是否可以做得更好？上面的解法将算法的时间复杂度降为了O(n)这个级别，但是需要进行两遍遍历。我们有没有可能使用一遍遍历完成这个问题？\n\n再看看这个问题：将只有0,1,2三种元素的数组排序。如果我们对这个数组进行三路快排的话，并且选择1是pivot，那么第一次partition的过程，就会把数组分成小于1的部分和大于1的部分，也就是所有的0在1的左边；所有的2在1的右边，就已经完成了排序！换句话说，我们对整个数组进行一次以1为pivot的三路快排的partition就完成了排序！而且，只进行了一次遍历！\n\n所以，我们只需要根据这个特殊的情况，改写三路快排的partition的思想就好了！在这里，我建议大家不要看之前的三路快排partition的代码，自己手写一下。我给出的参考答案如下：\n\n/// 解法三：基于三路快排的partition的解法，时间复杂度O(n)，只需要一边遍历\nclass Solution {\npublic:\n    void sortColors(vector<int>& nums) {\n\n        int i = 0;  // nums[0..<i) == 0\n        int j = 0;  // nums[i..<j) == 1\n        int k = nums.size(); // nums[k..<n) == 2\n\n        while( j < k ){\n            if( nums[j] == 1 )\n                j++;\n            else if( nums[j] == 0 )\n                swap( nums[i++] , nums[j++] );\n            else{ // nums[j] == 2\n                assert( nums[j] == 2 );\n                swap( nums[j] , nums[k-1] );\n                k --;\n            }\n        }\n\n        return;\n    }\n};\n怎么样，是不是很酷？另外，我们的课程曾经提到过，swap操作背后其实有三个步骤。很多问题，我们可以用赋值操作替代swap操作，来进行常数级的优化。有兴趣的同学不妨试试看？对于这个问题，我们可以很容易的抛弃swap操作来完成：）\n\n到这里，这个问题就为大家讲解完了。有没有觉得很简单的一个问题，也能引申出好多有意思的东西？\n\n关于以上解析中，留的一些关于这道题目的更多优化解法，可以参加这个repo: Sort Color\n\n我们下一次分享见：）\n\n关于我的更多文章，欢迎关注我的个人公众号：是不是很酷：）', '算法 杂谈 三路快排', 8, '', '', 0, 1543775255),
(4, 0, 1, 'aw', '【算法杂谈 2】情人节，用C++画一个心：）', '情人节到啦，作为程序员开发者，应该送给男女朋友什么礼物呢？我们这次不聊 算法与数据结构 ，一起用C++语言画个心作为礼物吧！（被罚跪搓衣板儿什么的概不负责= =）', '', '情人节 算法 心', 19, '', '', 0, 1543775461);

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `sex` tinyint(1) NOT NULL DEFAULT '0',
  `password` char(64) NOT NULL DEFAULT '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e',
  `description` varchar(100) NOT NULL,
  `email` varchar(50) NOT NULL,
  `birthday` int(11) NOT NULL DEFAULT '1',
  `level` tinyint(4) NOT NULL DEFAULT '1',
  `errCount` int(11) NOT NULL,
  `errTime` int(11) NOT NULL,
  `url` varchar(200) NOT NULL,
  `addr` varchar(15) NOT NULL,
  `buss` varchar(50) NOT NULL,
  `bussUrl` varchar(200) NOT NULL,
  `time` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=101 ;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `name`, `sex`, `password`, `description`, `email`, `birthday`, `level`, `errCount`, `errTime`, `url`, `addr`, `buss`, `bussUrl`, `time`) VALUES
(1, 'liuyubobobo', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', 'bobo@qq.com', 1, 1, 0, 0, '', '', '', '', 0),
(2, '摘星fy', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '123@123.123', 1, 1, 0, 0, '', '', '', '', 0),
(3, '侯鹏飞', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '2597457485@qq.com', 1, 1, 0, 0, '', '', '', '', 0),
(4, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(5, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(6, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(7, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(8, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(9, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(10, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(11, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(12, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(13, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(14, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(15, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(16, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(17, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(18, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(19, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(20, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(21, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(22, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(23, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(24, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(25, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(26, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(27, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(28, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(29, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(30, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(31, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(32, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(33, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(34, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(35, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(36, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(37, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(38, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(39, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(40, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(41, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(42, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(43, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(44, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(45, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(46, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(47, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(48, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(49, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(50, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(51, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(52, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(53, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(54, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(55, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(56, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(57, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(58, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(59, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(60, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(61, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(62, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(63, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(64, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(65, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(66, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(67, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(68, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(69, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(70, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(71, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(72, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(73, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(74, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(75, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(76, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(77, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(78, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(79, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(80, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(81, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(82, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(83, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(84, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(85, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(86, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(87, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(88, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(89, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(90, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(91, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(92, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(93, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(94, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(95, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(96, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(97, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(98, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(99, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0),
(100, '', 0, '96cae35ce8a9b0244178bf28e4966c2ce1b8385723a96a6b838858cdd6ca0a1e', '', '', 1, 1, 0, 0, '', '', '', '', 0);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
